/**
 * Created with JetBrains PhpStorm.
 * User: dreg
 * Date: 25.02.13
 * Time: 0:31
 * To change this template use File | Settings | File Templates.
 */
// Сюда подключить mocha и chai затем коффе компилятор
/*

Пречень тестов:

  1 сборка кофием
  2 создание класса
  3 перебор значений от -360 до +360 результаты должны быть в диапазоне от -180 до 180
  4 проверка простой суммы
  5 проверка простой разницы
  6 поиск пары углов ( проверяем значения пар и их знаки )

  todo 1) поиск кратчайшего пути между углами
  todo 2) сравнение углов (учитывать направление поворота)


 */

